{"pageProps":{"data":{"title":"블로그 첫 글을 시작하며","description":"바야흐로 2021년 10월.. 나만의 플랫폼을 만들었다. 이름하여 마고자비 블로그! ","date":"2021-10-17T21:53:07.322Z","tags":["첫글","블로그"],"author":"마고유","img":{"src":"/_next/static/image/src/assets/history/blog_first_context.0a432020d670eef57ed9422a7be46349.png","height":308,"width":414,"blurDataURL":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAgAAAAGCAYAAAD+Bd/7AAAAr0lEQVR42g3NvRLBQBgF0PvtJrHEBDNmKNBSGTMKrdJ7qz2AFwjjJ0hEIsnupT7FkcFoSkcw0Fqub4vdos/ZdIhjfJPz5Q7POhBQaKjYDzXinNBJAVIhirpUaV7/UaD8FjIYmE6Id+UQJx880xKyWm9YVpbtMJJu4KOtm39nUTvI65lQld8Pe2ENgwsNzpxPamSlRZo9IA3hFcVNtsshfR/S8XIELcPxoJL94QRLJz+zaFh//btyzwAAAABJRU5ErkJggg=="},"project":null,"readMin":6,"totalCnt":27,"monthlyCnt":0,"weeklyCnt":0,"category":"history"},"content":"\n&nbsp;\n\n&nbsp;\n\n# 첫 론칭😀\n\n---\n\n&nbsp; 누군가에게 공개하는 첫 글은 아마 싸이월드 다이어리가 아니었나 싶다. 내 머릿속 생각을 정리하고 싶거나 가끔은 누군가 봐줬으면 좋겠다는 생각에 은밀하지만 은밀하지 않았던 그런 글을 쓰곤 했다. 물론 지금도 마음만 먹으면 어디든 글을 쓸 수 있다.\n\n&nbsp;하지만, 특정 플랫폼에 종속된 글은 누군가 원하든 원하지 않든 피드에 공개되고 알 수 없는 알고리즘에 누군가에게 추천된다. 그게 싫었다. 순수했던 시절, 나의 침묵은 단순 플랫폼에 대한 거부감과 혹여나 나로 인해 거부감을 느낄 누군가 때문이었다. (명백히 이것은 핑계다. 글을 쓸 이유와 목적은 나이를 먹으면서 명백해지는데, 계속 이런저런 핑계로 미루었다.)\n\n&nbsp;바야흐로 2021년 10월.. 이젠 핑계를 댈 수 없도록 나의 플랫폼을 만들었다. 이름하여 마고자비 블로그! 마고자비 뜻은 매우 유치하다. 블로그의 가제였는데 중요하지 않은 일에 대한 기획은 목표와 더 멀어질 뿐이다. 그래서 유치한 title과 description을 그대로 사용하기로 하였다. 하고 싶은 것을 마구잡이로 한다는 description에 맞춰 앞으로 글을 쓸 예정이다.\n\n&nbsp;나의 직업은 프로덕트 엔지니어이고, 취미는 놀고먹는 것이다. 주로 노는 시간에는 무언가를 만든다. 세상의 빛을 보게 될 무언가를 만든다던가 세상에 빛을 보진 못하지만, 나의 성장에 도움이 될 무언가를 만든다.\n이 블로그는 나의 취미의, 취미에 의한, 취미를 위한 블로그가 될 것이다. 추가로 나와 같은 취미를 같은 누군가에게 도움을 줄 수 있는 블로그가 되도록 노력할 것이다.\n\n# &nbsp;\n\n# &nbsp;\n\n# 계획된 글\n\n---\n\n### 🥇 월간 개발(월간 마고유)\n\n&nbsp; 한 달에 하나씩 프로덕트를 계획하고 만들어 배포하는 프로젝트이다. 시간적 여유가 되면 가능하겠지만(사실 능력의 여유도...) 항상 욕심은 가지고 있다. 혼자서는 무리 일 수도 있다는 생각이다. 많은 사람은 필요 없지만, 취미와 목표가 같은 분들과 함께하고 싶다는 생각도 든다.\n\n### 🥈 블로그 제작기\n\n&nbsp; 이 블로그는 수많은 고민에서 태어났다. 결국 쉬운 방향으로 제작되었으나 9월부터 조금씩 sprint를 쪼개어 만들어 왔다. 투입된 시간은 그리 길지 않으나 이만저만 스트레스가 아니었다. 특히나 디자인에 대한 고민이 항상 가장 길었다. 조금만 검색해보면 자기만의 블로그를 제작하려는 사람들이 많다. 실제로 훌륭한 블로그를 만든 분들도 있고 그런 분들의 글을 참고하기도 했다. 마찬가지로 도움이 될 수 있도록 제작기를 써보고 싶다.\n\n### 🥉 기타 여행 맛집 글\n\n&nbsp; 기록은 곧 기억이다. 머리가 좋지 못해서 대부분의 추억은 사진 속 모습이다. 신기한 것은 그 모습의 분위기나 감정은 선명히 남아있다는 것이다. 단순 추억을 남기기 위한 글은 아니겠지만, 가끔 글을 남길 것이다.\n\n# &nbsp;\n\n# &nbsp;\n\n# 욕망에 충실한 개인과 효용이 넘치는 사회\n\n---\n\n&nbsp; 개개인이 욕망에 충실히 행동할수록 사회적 효용이 올라가는 사회가 됐으면 좋겠다고 친애하고 존경하는 DB 님이 가끔 말씀하신다. 이 블로그는 누군가를 위한 블로그가 아니다. 나의 욕망에 충실한 블로그이다. 하지만 내 욕망의 충실함이 누군가에게 도움이 되고 더 나아가 이 사회에 긍정적인 영향을 주었으면 좋겠다.\n\n# &nbsp;\n\n# &nbsp;\n"},"__N_SSG":true}