{"pageProps":{"data":{"title":"블로그 컨셉, 리뉴얼","description":"블로그 컨셉에 대한 고민, 로고 제작기, 그리고 앞으로의 방향성에 대해 알아봅니다.","date":"2022-05-29T02:00:07.322Z","tags":["블로그","nextjs","github","gh-pages","git","react","logo"],"author":"마고유","img":{"src":"/_next/static/image/src/assets/blog/blogRenew.676dd0919ca5f78b50636abe61128116.png","height":606,"width":810,"blurDataURL":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAgAAAAGCAQAAABUDBdwAAAAU0lEQVR42i3MQQqAIBQAUW9QWgsLXCgfvEFU1g2CvP9h/oTkdmCeyUSEhVWFSMZEDVgONnUEEkawnFRedhzSwsDNQ+VibCERmCgUnf8la0M9vqMf4MQ3AKpaVSQAAAAASUVORK5CYII="},"project":"blog","readMin":5,"totalCnt":0,"monthlyCnt":0,"weeklyCnt":0,"category":"web"},"content":"\n# 블로그 리뉴얼\n\n---\n\n&nbsp; [ \"공부하기 싫을 때 듣는 노래\"](https://www.youtube.com/watch?v=UmQIsUocNW8)라는 콘텐츠를 유튜브에서 보았다. 하기 싫은 일을 하고자 할 때 상대적으로 덜 하기 싫은 일이 재미있게 느껴진다는 내용이었다. 지금 내 상황을 대변하는 노래 같이 느껴졌다. 새로운 프로젝트를 계획하려다 보니 그동안 미뤄왔던 일들이 하나씩 생각나고 갑자기 흥미로워지면서 작업 욕구가 생겨났다. 그중 하나는 블로그 리뉴얼이다.\n\n&nbsp; 처음 블로그를 만들기 시작할 때 계획은 기본적인 기능만 만들고 글을 많이 쓰게 되면 카테고리, 태깅 등의 피쳐들을 개발하고 마지막에 로고를 만드는 것이었다.\n그런데 며칠 전 오랜만에 글을 하나 쓰고 보니 블로그가 마음에 들지 않아졌다.\n오늘 마침 여유시간들이 있었고, 창작 욕구가 막 샘솟아 결제하고 거의 쓰지 않았던 Sketch 디자인 툴을 열었다.\n\n&nbsp;\n\n# 홈 화면 개편\n\n---\n\n&nbsp; 홈 화면 개편을 위해 레퍼런스를 찾아야만 했다. 하지만 디자인에 문외한이었기 때문에 올바른 레퍼런스를 찾는 것은 쉽지 않았다. 그래서 전문가인 회사 동료 디자이너분께 부탁해서 몇 개의 레퍼런스를 추천 받았다. 추천받은 블로그들은 대부분 심플하고 깔끔한 블로그였다. 마음 같아서는 해당 블로그들을 클론 코딩하고 싶었지만, 나만의 블로그에 아이덴티티를 부여하고 싶다는 마음이 커서 컨셉을 고민해 보았다.\n\n&nbsp;\n![home-new](homeNew)\n\n&nbsp;\n&nbsp;\n\n## 블랙, 한글, 여백, 그리고 마구잡이\n\n### - 블랙\n\n&nbsp; primary color를 정하기 위해서 고민한 포인트는 세 가지다. 첫 번째는 전문성을 강조하고 싶었다. 여러 글을 쓸 계획이지만 결국 가장 많이 쓰는 글은 엔지니어링 관련 글이기 때문이다. 그리고 두 번째는 가장 선호하는 색상이다. 불과 몇 년 전까지는 비비드한 색상을 선호했다. 특히 빨간색과 파란색을 좋아했는데 어느 순간부터 검은색을 좋아하게 되었다. 그리고 마지막으로 다크모드이다. 이 세 가지 고민 포인트를 고려하여 결정한 색상은 검은색이다.\n\n### - 한글\n\n&nbsp; 영어가 많은 레퍼런스 블로그가 더 깔끔해 보이고, 전문적인 느낌이 났다. 외국어가 별로 안 쓰이는 레퍼런스를 거의 찾을 수 없었다. 한글을 사랑하거나 한글에 대한 애착이 어마어마한 것은 아니지만 그냥 오기가 생겼다. 그냥 한글로 깔끔하게 만들어 보기로.\n\n### - 여백과 마구잡이\n\n&nbsp; **\"저는 마고자비로 하고 싶은 것을 마구잡이로 합니다.\"** 블로그를 만들 당시 가부제였던 글귀이다. 마고라는 별칭을 짓고 언어유희로 블로그 이름을 마고자비(마고의 자비 혹은 마구잡이)라고 붙였던 것인데, 다양한 글을 쓸 예정이었기 때문에 마구잡이라는 컨셉이 마음에 들었다.\n이 컨셉은 리뉴얼할 때도 유지하고 싶었다. 하지만 \"마구잡이\"는 자칫하면 조잡함으로 보일 수 있다. 조잡함보다는 다양성을 강조하고 싶었고 깔끔함을 나타내고 싶었다. 그래서 화면에 최대한 여백을 많이 두고 다양함은 로고를 통해 나타내고자 하였다.\n\n&nbsp;\n\n## 로고 만들기\n\n&nbsp;\n![logo-making](logoMaking)\n\n&nbsp; \"마\"라는 텍스트를 로고로 표현하는 방식과 아이콘을 만드는 방식으로 진행해 보았다. 툴에 익숙하지 않고 디자인 센스도 없어서 선택지가 많지 않았다. 처음에는 \"마\"라는 단어를 여러 방법으로 꼬아봤는데 뭘 나타내는지도 명확하지 않았고 퀄리티도 만족스럽지 않았다. 그래서 텍스트를 바꾸는 방식은 포기하고 혼돈과 다양함을 나타내는 모양을 만들어 보자고 결심하였다.\n우연히 서로 다른 모양의 찌그러진 타원을 여러 방향으로 돌려서 겹쳐보았는데 전혀 규칙적이지 않은 패턴에서 어우러진 듯한 느낌을 받았고, 다크모드에서도 괜찮아 보여서 아래와 같은 이미지를 사용하기로 하였다.\n\n&nbsp;\n\n![blog-renew](blogRenew)\n\n&nbsp;\n\n# 정리하며\n\n---\n\n&nbsp;\n작업하면서 느낀 점은 아무리 작은 프로젝트여도 **기획 -> 디자인 -> 개발**의 flow는 무시할 수 없다는 것이다.\n그동안 취미를 일처럼 하고 싶지 않아서 task를 세분화하지 않고 코드를 바꿔가면서 작업을 했다. 모든 것을 하나로 퉁치려는 오만 덕분에 항상 프로젝트는 중간에서 막혔고 제대로 마무리할 수 없었다.\n가끔 애자일에 대한 환상과 오해로 인해 각 Task의 경계를 허물려는 시도를 종종 보곤했다. 이러한 시도가 올바른 것인지 효율적인지 아직 잘 모르겠다.\n다만 어설픈 시도는 프로젝트를 망치기 마련이다. 앞으로 개인 프로젝트를 더 잘 마무리할 수 있는 방법론에 대해서 더 연구해 봐야겠다.\n\n&nbsp;\n블로그 프로젝트를 하면서 느끼는 것이 많다. 개발이 아닌 기획, 디자인 업무의 고충을 잠시나마 느껴 볼 수 있었고 해당 업무의 중요성과 전문성도 느낄 수 있었다. 어설픈 부분이 많지만 점차 개선될 것으로 기대된다. 이제 남은 일은 개발에 반영하는 일이다. 다음 주에는 계획된 부분까지 꼭 마무리하고 오늘 본래 하고자 했었던 일을 진행해야겠다.\n"},"__N_SSG":true}